backend/controllers/ActivacionController.php

    public function actionUpdate()
    {
        if($model =  Activacion::find()->where(['id' =>
        1])->one()) {

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
SELECT * FROM `activacion` WHERE `id`=1
UPDATE `activacion` SET `activacion33`='Activo' WHERE `id`=1