backend/controllers/Etapa1Controller.php

SELECT * FROM `etapa_1` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = Etapa1::findOne(['id' => $id])) !== null) {