backend/controllers/Etapa2Controller.php

    protected function findModel($id)
    {
        if (($model = Etapa2::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `etapa_2` WHERE `id`='1'