frontend/controllers/Etapa4Controller.php

SELECT * FROM `etapa_4` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Etapa4::findOne(['id' => $id])) !== null) {