common/models/User.php

SELECT * FROM `user` WHERE (`id`=5) AND (`estado_id`=1)
---
    public static function findIdentity($id)//ENCONTRAR IDENTIDAD
    {
        return static::findOne(['id' => $id, 'estado_id' => ValorHelpers::getEstadoId('Activo')]);

SELECT * FROM `user` WHERE (`username`='17070016') AND (`estado_id`=1)
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'estado_id' => ValorHelpers::getEstadoId('Activo')]);

SELECT * FROM `rol` WHERE `id`=1
---
    public static function getRolLista()
    {
        $dropciones = Rol::find()->asArray()->all();

SELECT * FROM `estado`
---
        public static function getEstadoLista()
        {
            $dropciones = Estado::find()->asArray()->all();

SELECT * FROM `tipo_usuario`
---
        public static function getTipoUsuarioLista()
        {
            $dropciones = TipoUsuario::find()->asArray()->all();