common/models/User.php

        public static function getEstadoLista()
        {
            $dropciones = Estado::find()->asArray()->all();
---
SELECT * FROM `estado`

        public static function getTipoUsuarioLista()
        {
            $dropciones = TipoUsuario::find()->asArray()->all();
---
SELECT * FROM `tipo_usuario`