common/models/ValorHelpers.php

    public static function getUsersRolValor($userId=null)
    {
        if ($userId == null){
            $usersRolValor = Yii::$app->user->identity->rol->rol_valor;
            return isset($usersRolValor) ? $usersRolValor : false;
        } else {
            $user = User::findOne($userId);
---
SELECT * FROM `user` WHERE `id`=3

    public static function getRolValor($rol_nombre)
    {
        $rol = Rol::find('rol_valor')
            ->where(['rol_nombre' => $rol_nombre])
            ->one();
---
SELECT * FROM `rol` WHERE `rol_nombre`='Admin'

    public static function esRolNombreValido($rol_nombre)
    {
        $rol = Rol::find('rol_nombre')
            ->where(['rol_nombre' => $rol_nombre])
            ->one();
---
SELECT * FROM `rol` WHERE `rol_nombre`='Admin'

    public static function activarlaEtapa1($estado_nombre) //recibo inactivo
    {
        $userTieneEstadoName = Activacion::find('id')
        ->where(['activacion1' => $estado_nombre])
        ->one();
---
SELECT * FROM `activacion` WHERE `activacion1`='Activo'

    public static function activarlaEtapa2($estado_nombre) //recibo inactivo
    {
        $userTieneEstadoName = Activacion::find('id')
        ->where(['activacion2' => $estado_nombre])
        ->one();
---
SELECT * FROM `activacion` WHERE `activacion2`='Activo'

    public static function activarlaEtapa3($estado_nombre) //recibo inactivo
    {
        $userTieneEstadoName = Activacion::find('id')
        ->where(['activacion3' => $estado_nombre])
        ->one();
---
SELECT * FROM `activacion` WHERE `activacion3`='Activo'

    public static function activarlaEtapa4($estado_nombre) //recibo inactivo
    {
        $userTieneEstadoName = Activacion::find('id')
        ->where(['activacion33' => $estado_nombre])
        ->one();
---
SELECT * FROM `activacion` WHERE `activacion33`='Activo'

    public static function getEstadoId($estado_nombre)
    {
        $estado = Estado::find('id')
            ->where(['estado_nombre' => $estado_nombre])
            ->one();
---
SELECT * FROM `estado` WHERE `estado_nombre`='Activo'