backend/models/Etapa4.php

    public static function getAsesorInterno($id){
        if($user=Maestros::findOne($id))
---
SELECT * FROM `maestros` WHERE `id`='2'

public function getMaestroLista()
{
   $maestros = Maestros::find()->all();
---
SELECT * FROM `maestros`