frontend/models/Etapa4.php

SELECT * FROM `maestros` WHERE `id`='2'
---
    public static function getAsesorInterno($id){
        if($user=Maestros::findOne($id))