frontend/models/Etapa1.php

public static function getDesicionLista()
{
    $droptions = Desicion::find()->asArray()->all();
---
SELECT * FROM `desicion`

public static function getIngenieriasLista()
{
$droptions = Ingenierias::find()->asArray()->all();
---
SELECT * FROM `ingenierias`

public static function getGeneroLista()
{
$droptions = Genero::find()->asArray()->all();
---
SELECT * FROM `genero`