frontend/models/SignupForm.php

INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `verification_token`, `estado_id`, `rol_id`, `tipo_usuario_id`, `created_at`, `updated_at`) VALUES ('17070025', 'sergio.coatlperez5@itsva.edu.mx', '$2y$13$VGo9R/6Mnzi0piPcYw06UeGKYX84KBqvNgWPFhzSQH2T2tO3vsMCO', 'g7AxAvVSUFI707b2rsCCBV0xlRaOldFk', 'ar_fanCuPQD5bksKKOAZW-XITN-BmMvO_1673904199', 1, 1, 1, NOW(), NOW())
---
    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->generateEmailVerificationToken();

        return $user->save() && $this->sendEmail($user);